In [1]:
#Series

In [9]:
import pandas as pd
x = [3,6,9,4,8,1,2]
var = pd.Series(x)
print(var)

0    3
1    6
2    9
3    4
4    8
5    1
6    2
dtype: int64

In [3]:
##DataFrames

In [10]:
l = [1,2,3,4,5,6]
var = pd.DataFrame(l)
var

   0
0  1
1  2
2  3
3  4
4  5
5  6

In [11]:
d = {"a":[1,2,3],"b":[4,5,6]}
var1 = pd.DataFrame(d)
var1

   a  b
0  1  4
1  2  5
2  3  6

In [6]:
var1["Sum"] = var1["a"]+var1["b"]
var1

   a  b  Sum
0  1  4    5
1  2  5    7
2  3  6    9

In [7]:
var1["a"]

0    1
1    2
2    3
Name: a, dtype: int64

In [12]:
var1["S"] = var1["a"]<=2
var1

   a  b      S
0  1  4   True
1  2  5   True
2  3  6  False

#insert

In [20]:
var1["Sum"] = var1["a"]+var1["b"]
var1
var1.insert(2,"B",12)

In [26]:
var1.pop("S")

0     True
1     True
2    False
Name: S, dtype: bool

In [27]:
var1

   a  b  Sum
0  1  4    5
1  2  5    7
2  3  6    9

In [28]:
var1.insert(3,"Sub",[-3,-3,-3])

In [29]:
var1

   a  b  Sum  Sub
0  1  4    5   -3
1  2  5    7   -3
2  3  6    9   -3

In [31]:
var1.to_csv("test1.csv")